#### Python Basics-3

In [1]:
import numpy as np
import pandas as pd

###### 1.	Create a series using a list (my_list) and an array (my_arr). Both can be of length 10

In [2]:
#my_list=list(range(10))
my_list=['nameid','voterid','phoneid','doorid','genderid','salaryid','companyid','passportid','aadhaarid','drivingid']
my_list
#type(my_list)

['nameid',
 'voterid',
 'phoneid',
 'doorid',
 'genderid',
 'salaryid',
 'companyid',
 'passportid',
 'aadhaarid',
 'drivingid']

In [3]:
#my_arr=np.arange(10)
my_arr=np.array(['N12','V12','P12','D12','G12','S12','C12','P12','A12','D12'])
my_arr
#type(my_arr)

array(['N12', 'V12', 'P12', 'D12', 'G12', 'S12', 'C12', 'P12', 'A12',
       'D12'], dtype='<U3')

In [4]:
seriesA=pd.Series(my_arr,index=[['AV1','AV2','AV3','AV4','AV5','AV6','AV7','AV8','AV9','AV10']])
seriesA
#pd.Series?

AV1     N12
AV2     V12
AV3     P12
AV4     D12
AV5     G12
AV6     S12
AV7     C12
AV8     P12
AV9     A12
AV10    D12
dtype: object

In [5]:
seriesL=pd.Series(my_list,index=[['LV1','LV2','LV3','LV4','LV5','LV6','LV7','LV8','LV9','LV10']])
seriesL

LV1         nameid
LV2        voterid
LV3        phoneid
LV4         doorid
LV5       genderid
LV6       salaryid
LV7      companyid
LV8     passportid
LV9      aadhaarid
LV10     drivingid
dtype: object

###### 2.	Create a series using a dictionary from above my_list and my_arr as key and value pairs (Hint: my_dict = dict(zip(my_list, my_arr))

In [6]:
my_dict=dict(zip(my_list,my_arr))
my_dict

{'nameid': 'N12',
 'voterid': 'V12',
 'phoneid': 'P12',
 'doorid': 'D12',
 'genderid': 'G12',
 'salaryid': 'S12',
 'companyid': 'C12',
 'passportid': 'P12',
 'aadhaarid': 'A12',
 'drivingid': 'D12'}

In [7]:
seriesD=pd.Series(my_dict)
seriesD

nameid        N12
voterid       V12
phoneid       P12
doorid        D12
genderid      G12
salaryid      S12
companyid     C12
passportid    P12
aadhaarid     A12
drivingid     D12
dtype: object

###### 3.	Create 3 series of different data types and concatenate them across axis = 1

In [8]:
series1=pd.Series(['Rebecca',167,'23-Apr'],index=['Name','Height','DOB'])
series1

Name      Rebecca
Height        167
DOB        23-Apr
dtype: object

In [9]:
series2=pd.Series(['Pearlson',175,'24-Apr'],index=['Name','Height','DOB'])
series2

Name      Pearlson
Height         175
DOB         24-Apr
dtype: object

In [10]:
series3=pd.Series(['Jesuvin',183,'25 Dec'],index=['Name','Height','DOB'])
series3

Name      Jesuvin
Height        183
DOB        25 Dec
dtype: object

In [11]:
pd.concat?

In [12]:
mainSeries=pd.concat([series1,series2,series3],axis=1)
mainSeries
mainSeries

              0         1        2
Name    Rebecca  Pearlson  Jesuvin
Height      167       175      183
DOB      23-Apr    24-Apr   25 Dec

In [13]:
series11=pd.Series(['Rebecca','Pearlson','Jesuvin'])
series12=pd.Series([167,175,183])
series13=pd.Series(['23-Apr','24-Apr','25-Dec'])
mainSeries1=pd.DataFrame(pd.concat([series11,series12,series13],axis=1),columns=['Name','Height','DOB'])
mainSeries1

   Name  Height  DOB
0   NaN     NaN  NaN
1   NaN     NaN  NaN
2   NaN     NaN  NaN

In [14]:
MainSeries=pd.DataFrame?
#(mainSeries1,columns=['Name','Height','DOB'])
#MainSeries

###### 4.	Create a data frame using a list of list and dictionary using a forced index

In [15]:
dataFrameL=pd.DataFrame([['Reb',167],['Pearl',177],['Nimmy',156],['James',175]],columns=['Names','Heights'],index=['Candidate-1','Candidate-2','Candidate-3','Candidate-4'])
dataFrameL
#pd.DataFrame?

             Names  Heights
Candidate-1    Reb      167
Candidate-2  Pearl      177
Candidate-3  Nimmy      156
Candidate-4  James      175

In [16]:
dictt={'Names':['Reb','Pearl','Nimmy','James'],'Heights':[167,177,156,175]}
type(dictt)

dict

In [17]:
#dataFrameD=pd.DataFrame(dictt,index=['Candidate-1','Candidate-2','Candidate-3','Candidate-4'])
#dataFrameD
dataFrameDD=pd.DataFrame({'Names':['Reb','Pearl','Nimmy','James'],'Heights':[167,177,156,175]},index=['Candidate-1','Candidate-2','Candidate-3','Candidate-4'])
dataFrameDD

             Names  Heights
Candidate-1    Reb      167
Candidate-2  Pearl      177
Candidate-3  Nimmy      156
Candidate-4  James      175

###### 5.	Create a data frame with 2 integer columns and perform at least 3 numerical operation and storing them as adjacent columns. Your final df should contain 5 columns

In [18]:
dataFrameInt=pd.DataFrame({'Maths':[100,95,35,49],'Science':[167,177,156,175]},index=['Candidate-1','Candidate-2','Candidate-3','Candidate-4'])
dataFrameInt
dataFrameInt['Total Marks Obtained']=dataFrameInt['Maths']+dataFrameInt['Science']
dataFrameInt
dataFrameInt['Percentage Achieved']=round((dataFrameInt['Total Marks Obtained']/300)*100,2)
dataFrameInt
gradeValue=[]
for i in dataFrameInt['Percentage Achieved']:
    if i>=90:
        gradeValue.append('Distinction')
    if 80>i<90:
        gradeValue.append('Excellence')
    if 70>i<81:
        gradeValue.append('Good')
    if 50>i<71:
        gradeValue.append('Can do better')
    if i<51:
        gradeValue.append('Very Bad')
    

dataFrameInt['Grade']=gradeValue

dataFrameInt
dataFrameIntDelete=dataFrameInt
dataFrameIntDrop=dataFrameInt
dataFrameInt

,Maths,Science,Total Marks Obtained,Percentage Achieved,Grade
Candidate-1,100,167,267,89.00,Distinction
Candidate-2,95,177,272,90.67,Excellence
Candidate-3,35,156,191,63.67,Good
Candidate-4,49,175,224,74.67,Excellence

###### 6.	Delete 2 columns using del and drop function

In [19]:
dataFrameIntDrop

,Maths,Science,Total Marks Obtained,Percentage Achieved,Grade
Candidate-1,100,167,267,89.00,Distinction
Candidate-2,95,177,272,90.67,Excellence
Candidate-3,35,156,191,63.67,Good
Candidate-4,49,175,224,74.67,Excellence

In [20]:
dataFrameIntDrop.drop(columns='Total Marks Obtained',inplace=True)
dataFrameIntDrop

             Maths  Science  Percentage Achieved        Grade
Candidate-1    100      167                89.00  Distinction
Candidate-2     95      177                90.67   Excellence
Candidate-3     35      156                63.67         Good
Candidate-4     49      175                74.67   Excellence

In [21]:
del
#(columns='Total Marks Obtained',inplace=True)
#dataFrameIntDelete

SyntaxError: invalid syntax (<ipython-input-21-fa9238196724>, line 1)

###### 7.	Create a data frame with shape 10x5 and extract only those records that are beyond row# 5

In [22]:
df = pd.DataFrame({'Name': [1, 2,3,4,5,6,7,8,9,10], 'Age': [11,12,13,14,15,16,17,18,19,20],'Sex': [21,22,23,24,25,26,27,28,29,30],'Weight':
                  [50,70,65,89,100,34,109,87,54,39],'Gender': ['M','F','M','M','F','F','F','M','F','F']})
#df.shape 2,3
df.shape

(10, 5)

In [23]:
df1=pd.DataFrame(np.random.randint(low=0,high=100,size=(10,5)))
df1
#pd.DataFrame(np.random.randint(low=0, high=10, size=(5, 5)),
#...                    columns=['a', 'b', 'c', 'd', 'e'])

df2=df1.loc[df.index>4]
df2

    0   1   2   3   4
5  20  42  58   3  83
6  71  35  17  42  41
7  29  77  11  34  51
8  58  75  85  78  76
9  47  53  77  74  13

###### 8.	Add a last row in a data frame and reset their index

In [ ]:
df2
#([[123,134,156,123,123]])
#df2
df2=pd.concat([54,432,44,55,66])
df2

In [25]:
df3=pd.DataFrame({'Name':['Reb','Pearlson'],'DOB':['23-Apr','24-Apr'],'Gender':['F','M']})
df3

       Name     DOB Gender
0       Reb  23-Apr      F
1  Pearlson  24-Apr      M

In [26]:
df3=df3.append({'Name':'Nimmy','DOB':'30-Jun','Gender':'F'},ignore_index=True)
df3=df3.append({'Name':'James','DOB':'08-May','Gender':'F'},ignore_index=True)
df3=df3.append({'Name':'John','DOB':'10-Apr','Gender':'F'},ignore_index=True)
df3=df3.append({'Name':'Arti','DOB':'24-Aug','Gender':'F'},ignore_index=True)
df3

       Name     DOB Gender
0       Reb  23-Apr      F
1  Pearlson  24-Apr      M
2     Nimmy  30-Jun      F
3     James  08-May      F
4      John  10-Apr      F
5      Arti  24-Aug      F

In [27]:
df3.reset_index(inplace=True)
df3

   index      Name     DOB Gender
0      0       Reb  23-Apr      F
1      1  Pearlson  24-Apr      M
2      2     Nimmy  30-Jun      F
3      3     James  08-May      F
4      4      John  10-Apr      F
5      5      Arti  24-Aug      F

In [28]:
df3[0:3]

   index      Name     DOB Gender
0      0       Reb  23-Apr      F
1      1  Pearlson  24-Apr      M
2      2     Nimmy  30-Jun      F

In [29]:
df3[::]

   index      Name     DOB Gender
0      0       Reb  23-Apr      F
1      1  Pearlson  24-Apr      M
2      2     Nimmy  30-Jun      F
3      3     James  08-May      F
4      4      John  10-Apr      F
5      5      Arti  24-Aug      F

In [55]:
a=np.array(df3)
a
a[0:5,len(df3)-2:4]
#df3[0:5:1:4]?

array([], shape=(5, 0), dtype=object)

In [31]:
df3.head()

   index      Name     DOB Gender
0      0       Reb  23-Apr      F
1      1  Pearlson  24-Apr      M
2      2     Nimmy  30-Jun      F
3      3     James  08-May      F
4      4      John  10-Apr      F

In [32]:
df3.tail()

   index      Name     DOB Gender
1      1  Pearlson  24-Apr      M
2      2     Nimmy  30-Jun      F
3      3     James  08-May      F
4      4      John  10-Apr      F
5      5      Arti  24-Aug      F

In [33]:
type(df3)

pandas.core.frame.DataFrame

In [34]:
df3.shape

(6, 4)

In [35]:
df3.size

24

In [36]:
df3.sum(axis=1)

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [38]:
df3.loc['meanValue']=df3.mean()
df3

           index      Name     DOB Gender
0            0.0       Reb  23-Apr      F
1            1.0  Pearlson  24-Apr      M
2            2.0     Nimmy  30-Jun      F
3            3.0     James  08-May      F
4            4.0      John  10-Apr      F
5            5.0      Arti  24-Aug      F
meanValue    2.5       NaN     NaN    NaN

In [39]:
df3.loc['medianValue']=df3.median()
df3

             index      Name     DOB Gender
0              0.0       Reb  23-Apr      F
1              1.0  Pearlson  24-Apr      M
2              2.0     Nimmy  30-Jun      F
3              3.0     James  08-May      F
4              4.0      John  10-Apr      F
5              5.0      Arti  24-Aug      F
meanValue      2.5       NaN     NaN    NaN
medianValue    2.5       NaN     NaN    NaN

In [43]:
df3.loc[:,'index'].mode()

0    2.5
dtype: float64

In [44]:
df3.loc[:,'Name'].mode()

0        Arti
1       James
2        John
3       Nimmy
4    Pearlson
5         Reb
dtype: object

In [45]:
df3.loc[:,'DOB'].mode()

0    08-May
1    10-Apr
2    23-Apr
3    24-Apr
4    24-Aug
5    30-Jun
dtype: object

In [46]:
df3.loc[:,'Gender'].mode()

0    F
dtype: object

In [47]:
df3.describe()

          index
count  8.000000
mean   2.500000
std    1.581139
min    0.000000
25%    1.750000
50%    2.500000
75%    3.250000
max    5.000000

In [49]:
df3.loc[:,'index'].max()

5.0

In [66]:
df3

             index      Name     DOB Gender
0              0.0       Reb  23-Apr      F
1              1.0  Pearlson  24-Apr      M
2              2.0     Nimmy  30-Jun      F
3              3.0     James  08-May      F
4              4.0      John  10-Apr      F
5              5.0      Arti  24-Aug      F
meanValue      2.5       NaN     NaN    NaN
medianValue    2.5       NaN     NaN    NaN

In [67]:
df3.sort_values(by='index',ascending=False)

             index      Name     DOB Gender
5              5.0      Arti  24-Aug      F
4              4.0      John  10-Apr      F
3              3.0     James  08-May      F
meanValue      2.5       NaN     NaN    NaN
medianValue    2.5       NaN     NaN    NaN
2              2.0     Nimmy  30-Jun      F
1              1.0  Pearlson  24-Apr      M
0              0.0       Reb  23-Apr      F

In [56]:
np.sqrt(7.5)

2.7386127875258306

In [69]:
df3.iLoc(0:5)

SyntaxError: invalid syntax (<ipython-input-69-4be4813ab2f4>, line 1)